# ----------------------------------------
# Developer Tools
# ----------------------------------------
cask "cursor"
cask "pycharm"
cask "wireshark-app"
brew "git-filter-repo"

# ----------------------------------------
# AI Tools
# ----------------------------------------
cask "chatgpt"
cask "lm-studio"
cask "ollama-app"
brew "gemini-cli"
cask "claude"
cask "claude-code"


# ----------------------------------------
# Productivity
# ----------------------------------------
cask "arc"
cask "coteditor"
cask "google-chrome"
cask "google-drive"
cask "notion"
cask "obsidian"
cask "updf"
cask "zotero"
cask "sublime-text"
cask "anki"
cask "squirrel-app"
cask "thorium"

# ----------------------------------------
# Media & Design
# ----------------------------------------
cask "handbrake-app"
cask "iina"
cask "obs"
cask "qview"

# ----------------------------------------
# Social & Comm
# ----------------------------------------
cask "neteasemusic"
cask "qq"
cask "tencent-meeting"

# ----------------------------------------
# Utilities & Network
# ----------------------------------------
cask "appcleaner"
cask "battery-buddy"
cask "keepingyouawake"
cask "mos"
cask "tailscale-app"
cask "the-unarchiver"
brew "htop"
cask "keka"
cask "jordanbaird-ice"

# ----------------------------------------
# CLI Tools
# ----------------------------------------
brew "jq"
brew "tldr"
brew "yt-dlp"
brew "btop"

# ----------------------------------------
# Medical Related Tools
# ----------------------------------------
cask "horos"

