# ============================================================
# Brewfile
# ============================================================

# ------------------------------------------------------------
# Shell & Terminal Environment
# ------------------------------------------------------------
brew "starship"                  # Cross-shell prompt used by ~/.zshrc.
brew "zsh-autosuggestions"       # Fish-like command autosuggestions for Zsh.
brew "zsh-syntax-highlighting"   # Syntax highlighting while typing commands in Zsh.
brew "zsh-completions"           # Additional completion definitions for Zsh.
brew "eza"                       # Modern ls replacement; used by alias ls='eza --icons=always'.
brew "bat"                       # Modern cat replacement with syntax highlighting; used by alias cat='bat'.
brew "zoxide"                    # Smarter cd replacement using directory frecency.
brew "tree"                      # Displays directory structures as trees.
brew "tldr"                      # Community-maintained concise command examples.
brew "glow"                      # Terminal Markdown viewer.

# ------------------------------------------------------------
# Language Runtimes & Version Management
# ------------------------------------------------------------
brew "mise"                      # Runtime/version manager activated in ~/.zshrc.
brew "uv"                        # Fast Python package/project runner.
brew "go"                        # Go toolchain; matches $HOME/go/bin PATH usage.
cask "miniforge"                 # Conda-compatible Python distribution used by ~/.zshrc.

# ------------------------------------------------------------
# Core Developer Tools
# ------------------------------------------------------------
brew "git"                       # Distributed version control system.
brew "git-filter-repo"           # Advanced Git history rewriting tool.
brew "git-delta"                 # Better syntax-highlighted Git diffs.
brew "gnupg"                     # GPG encryption/signing; used with GPG_TTY.
brew "gh"                        # GitHub CLI for issues, PRs, repos, and workflows.
cask "cursor"                    # AI-focused code editor.
cask "pycharm"                   # JetBrains Python IDE.
cask "sublime-text"              # Lightweight extensible code/text editor.
cask "coteditor"                 # Native macOS plain-text editor.

# ------------------------------------------------------------
# AI & Local LLM Tools
# ------------------------------------------------------------
cask "chatgpt"                   # ChatGPT desktop app.
cask "claude"                    # Claude desktop app.
cask "codex-app"                 # OpenAI Codex desktop coding agent.
cask "lm-studio"                 # Local LLM GUI and server.
cask "ollama-app"                # Local LLM runtime with Ollama.app and ollama CLI.

# ------------------------------------------------------------
# Search, Code Analysis & Refactoring
# ------------------------------------------------------------
brew "ripgrep"                   # Fast recursive text/code search.
brew "fd"                        # Modern find replacement for file discovery.
brew "ast-grep"                  # AST-aware code search, linting, and rewriting.  [oai_citation:1‡Homebrew Formulae](https://formulae.brew.sh/formula/ast-grep?utm_source=chatgpt.com)
brew "semgrep"                   # Static analysis and security/code-pattern scanning.

# ------------------------------------------------------------
# Structured Data: JSON, YAML, CSV, XML, HTML
# ------------------------------------------------------------
brew "jq"                        # JSON query and transformation tool.
brew "yq"                        # YAML/TOML/XML processor with jq-like syntax.
brew "xsv"                       # Fast CSV slicing, stats, indexing, and search.
brew "csvkit"                    # CSV inspection and SQL-style command-line toolkit.
brew "miller"                    # awk/sed/jq-like processor for CSV, TSV, JSON, and more.
brew "pup"                       # HTML parser/query tool.
brew "xmlstarlet"                # XML query, transform, validate, and edit tool.

# ------------------------------------------------------------
# Documents, PDF & Media Processing
# ------------------------------------------------------------
brew "pandoc"                    # Universal document converter.
brew "poppler"                   # PDF utilities such as pdftotext, pdfinfo, and pdfimages.
brew "yt-dlp"                    # Video/audio downloader.
cask "handbrake-app"             # Video transcoding GUI.
cask "iina"                      # macOS media player.
cask "obs"                       # Screen recording and streaming.
cask "updf"                      # PDF reader/editor.

# ------------------------------------------------------------
# Databases & API Debugging
# ------------------------------------------------------------
brew "sqlite"                    # SQLite database engine and sqlite3 CLI.
brew "httpie"                    # Human-friendly HTTP/API client.

# ------------------------------------------------------------
# Monitoring, Logs & System Inspection
# ------------------------------------------------------------
brew "btop"                      # Interactive system resource monitor.
brew "htop"                      # Interactive process viewer.
brew "entr"                      # Run commands when files change.
brew "lnav"                      # Log file navigator and analyzer.
cask "wireshark-app"             # Network protocol analyzer.

# ------------------------------------------------------------
# Browsers & Web Apps
# ------------------------------------------------------------
cask "arc"                       # Arc browser.
cask "google-chrome"             # Google Chrome browser.
cask "thorium"                   # Chromium-based browser optimized for performance.

# ------------------------------------------------------------
# Notes, Knowledge & Productivity
# ------------------------------------------------------------
cask "google-drive"              # Google Drive sync client.
cask "dropbox"                   # Dropbox sync client.
cask "notion"                    # Notion workspace app.
cask "obsidian"                  # Markdown-based personal knowledge base.
cask "zotero"                    # Reference manager.
cask "anki"                      # Spaced-repetition flashcard app.
cask "netnewswire"               # RSS reader.
cask "ticktick"                  # Task manager.
cask "adobe-creative-cloud"      # Adobe Creative Cloud manager.

# ------------------------------------------------------------
# Communication & Social
# ------------------------------------------------------------
cask "qq"                        # Tencent QQ client.
cask "telegram"                  # Telegram desktop client.
cask "tencent-meeting"           # Tencent Meeting video conferencing.
cask "neteasemusic"              # NetEase Cloud Music app.

# ------------------------------------------------------------
# macOS Utilities & Networking
# ------------------------------------------------------------
cask "appcleaner"                # App uninstaller and leftover-file cleaner.
cask "battery-buddy"             # Battery status menu bar utility.
cask "keepingyouawake"           # Prevents macOS from sleeping.
cask "mos"                       # Smooth scrolling and mouse wheel utility.
cask "tailscale-app"             # Tailscale mesh VPN GUI.
cask "the-unarchiver"            # Archive extraction utility.
cask "squirrel-app"              # Squirrel input method framework.

# ------------------------------------------------------------
# Medical / Imaging
# ------------------------------------------------------------
cask "horos"                     # DICOM medical image viewer.
